---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.Product
source: html/90c56de3-99ff-cb0d-2303-576cf0e06d1d.htm
---
# Autodesk.Revit.ApplicationServices.Application.Product Property

The product type for the current session of Revit.

## Syntax (C#)
```csharp
public ProductType Product { get; }
```